public class work4{
	public static void main (String[] args){
		
		int x1 = 5;
		int y1 = 5;
        if(x1++==6 & ++y1==6){//x1++==6,由于后++遵循先判断后自增，故x1=5不等于6，出现false
        	x1=11;//不被执行
        }
        System.out.println("x1="+x1+",y1="+y1);//易错成x1 = 11 , y1 = 6
        //实际输出x1 = 6, y1 =6

        int x2 = 5;
        int y2 = 5;
        if(x2++==6 && ++y2==6){
        	x2=11;
        }
        System.out.println("x2="+x2+",y2="+y2);//x2 = 6 , y2 = 5

        int x3 = 5;
        int y3 = 5;
        if(x3++==5 | ++y3==5){//左真右假 , 逻辑或 中 一真则真
            x3 = 11;//执行
        }
        System.out.println("x3="+x3+",y3="+y3);//x3 = 11, y3 =6

        int x4 = 5;
        int y4 = 5;
        if(x4++==5 || ++y4==5){//左真，y4的自增不被执行
            x4 = 11;//执行
        }
        System.out.println("x4="+x4+",y4="+y4);//x4 = 11, y4 = 5
//********************************************************************************
        boolean x5 = true;
        boolean y5 = false;
        byte z = 46;
        if(z++==46 && (y5=true)){//左真右真，最终结果为真.
            //易错：若右侧表达式y5=true不添加括号会报错；且这是赋值操作，
            //即右侧表达式结果为true
            z++;//执行
        }//至此z = 48
        if(x5=false || ++z==49){//z=49,左假右真,最终为真，赋值表达式位于左侧反而不用加括号
            z++;//执行
        }
        System.out.println("z="+z);//z=50
 //********************************************************************************     
	}
}